rhgndf/hfsdr/ch32v305/src/ui/ui.c
#include "ui/ui.h"

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "feature/fm_audio_out/fm_audio_out.h"
#include "hw/dac.h"
#include "hw/display/st7789.h"
#include "hw/display/splash.h"
#include "hw/encoder.h"
#include "hw/si5351.h"
#include "hw/tlv320adc6120.h"
#include "hw/usb.h"
#include "ui/fft.h"

#include "ch32v30x.h"
#include "system_ch32v30x.h"

#define UI_HEADER_BOTTOM_Y 79U
#define UI_FREQ_TEXT_Y     10U
#define UI_FREQ_DIGITS     9U
#define UI_FREQ_SUFFIX_CHARS 3U
#define UI_FREQ_TEXT_WIDTH ((UI_FREQ_DIGITS + UI_FREQ_SUFFIX_CHARS) * Font_16x26.width)
#define UI_FREQ_SUFFIX_X   ((UI_FREQ_DIGITS * Font_16x26.width) + (Font_16x26.width / 2U))
#define UI_MODE_TEXT_X     (ST7789_WIDTH - (4U * Font_11x18.width) - 1U)
#define UI_MODE_TEXT_Y     0U
#define UI_MODE_TEXT_WIDTH (4U * Font_11x18.width)
#define UI_MODE_TEXT_HEIGHT Font_11x18.height
#define UI_TRIANGLE_Y      1U
#define UI_VOL_ROW_Y       40U
#define UI_GAIN_ROW_Y      60U
#define UI_BAR_X           55U
#define UI_BAR_WIDTH       170U
#define UI_BAR_HEIGHT      12U
#define UI_VOLUME_MAX      100U
#define UI_VOLUME_DEFAULT  71U
#define UI_AUDIO_GAIN_MAX_Q16 (32UL << 8)
#define UI_TLV320_GAIN_MIN_DB_X2     TLV320ADC6120_CH_GAIN_MIN_DB_X2
#define UI_TLV320_GAIN_MAX_DB_X2     ((int8_t)TLV320ADC6120_CH_GAIN_MAX_DB_X2)
#define UI_TLV320_GAIN_DEFAULT_DB_X2 0

/* Match fft.cpp waterfall band (portrait). */
#define UI_WATERFALL_TOP     80U
#define UI_WATERFALL_BOTTOM  320U

/* Landscape splash_freq.png MHz readout quad (clockwise from top-left). */
#define UI_SPLASH_TEXT_X0    77U
#define UI_SPLASH_TEXT_Y0    24U
#define UI_SPLASH_TEXT_X1    167U
#define UI_SPLASH_TEXT_Y1    33U
#define UI_SPLASH_TEXT_X2    166U
#define UI_SPLASH_TEXT_Y2    74U
#define UI_SPLASH_TEXT_X3    76U
#define UI_SPLASH_TEXT_Y3    60U
#define UI_SPLASH_TEXT_BASELINE_DX  10
#define UI_SPLASH_TEXT_BASELINE_DY  1
#define UI_SPLASH_TEXT_SHEAR_NUM   (-1)
#define UI_SPLASH_TEXT_SHEAR_DEN   36
#define UI_SPLASH_FREQ_STEP_HZ 100000ULL

/* Landscape waveform scope quad (same vertex order as MHz quad). */
#define UI_SPLASH_WAVE_X0    188U
#define UI_SPLASH_WAVE_Y0    34U
#define UI_SPLASH_WAVE_X1    185U
#define UI_SPLASH_WAVE_Y1    102U
#define UI_SPLASH_WAVE_X2    314U
#define UI_SPLASH_WAVE_Y2    121U
#define UI_SPLASH_WAVE_X3    319U
#define UI_SPLASH_WAVE_Y3    48U
#define UI_SPLASH_WAVE_DISPLAY_COLS  128U
#define UI_SPLASH_WAVE_PERIOD_MS     36U
#define UI_SPLASH_WAVE_MIN_PEAK_ABS  120
#define UI_SPLASH_WAVE_PEAK_CEILING 2400 /* cap AGC so loud FM does not flatten trace */
#define UI_SPLASH_WAVE_DEFLECT_MUL   1600 /* 10x vs 320; paired with DIV along thickness vector */
#define UI_SPLASH_WAVE_DEFLECT_DIV   3072

typedef struct
{
    uint16_t x0;
    uint16_t y0;
    uint16_t x1;
    uint16_t y1;
    uint16_t x2;
    uint16_t y2;
    uint16_t x3;
    uint16_t y3;
} ui_splash_quad_t;

typedef enum
{
    UI_SPLASH_APPEARANCE_NORMAL,
    UI_SPLASH_APPEARANCE_INVERTED,
    UI_SPLASH_APPEARANCE_COUNT
} ui_splash_appearance_t;

typedef enum
{
    UI_DISPLAY_SPLASH,
    UI_DISPLAY_WATERFALL
} ui_display_mode_t;

static ui_display_mode_t s_display_mode = UI_DISPLAY_SPLASH;
static bool s_splash_band_dirty = true;
static ui_splash_appearance_t s_splash_appearance = UI_SPLASH_APPEARANCE_NORMAL;
static ui_splash_appearance_t s_displayed_splash_appearance = UI_SPLASH_APPEARANCE_COUNT;
static uint8_t s_splash_button_phase = 0U;
static uint64_t s_displayed_splash_freq_hz = UINT64_MAX;
static uint64_t s_last_splash_wave_tick = 0ULL;
static int32_t s_splash_wave_display_peak = (int32_t)UI_SPLASH_WAVE_MIN_PEAK_ABS;
static uint16_t s_splash_wave_prev_x[UI_SPLASH_WAVE_DISPLAY_COLS];
static uint16_t s_splash_wave_prev_y[UI_SPLASH_WAVE_DISPLAY_COLS];
static bool s_splash_wave_poly_valid = false;
/* Last MADCTL value applied by UI (0xFF = never synced this session). */
static uint8_t s_hw_madctl = 0xFFU;

static uint64_t s_displayed_freq_hz = UINT64_MAX;
static uint8_t s_displayed_volume = UINT8_MAX;
static int8_t s_displayed_tlv320_gain_db_x2 = INT8_MAX;
static fm_audio_out_mode_t s_displayed_fm_mode = FM_AUDIO_OUT_MODE_COUNT;
static uint8_t s_volume = UI_VOLUME_DEFAULT;
static int8_t s_tlv320_gain_db_x2 = UI_TLV320_GAIN_DEFAULT_DB_X2;
static bool s_redraw_all = true;

typedef enum
{
    UI_CONTROL_FREQ_10_MHZ,
    UI_CONTROL_FREQ_1_MHZ,
    UI_CONTROL_FREQ_100_KHZ,
    UI_CONTROL_FREQ_10_KHZ,
    UI_CONTROL_FM_MODE,
    UI_CONTROL_VOLUME,
    UI_CONTROL_TLV320_GAIN,
    UI_CONTROL_COUNT
} ui_control_t;

static ui_control_t s_active_control = UI_CONTROL_FREQ_10_MHZ;
static ui_control_t s_displayed_active_control = UI_CONTROL_COUNT;

static bool ui_control_is_frequency(ui_control_t control)
{
    return control <= UI_CONTROL_FREQ_10_KHZ;
}

static uint64_t ui_frequency_step_hz(ui_control_t control)
{
    switch(control)
    {
        case UI_CONTROL_FREQ_10_KHZ:
            return 10000ULL;
        case UI_CONTROL_FREQ_100_KHZ:
            return 100000ULL;
        case UI_CONTROL_FREQ_1_MHZ:
            return 1000000ULL;
        case UI_CONTROL_FREQ_10_MHZ:
            return 10000000ULL;
        default:
            return 100000ULL;
    }
}

static uint8_t ui_frequency_digit_power(ui_control_t control)
{
    switch(control)
    {
        case UI_CONTROL_FREQ_10_KHZ:
            return 4U;
        case UI_CONTROL_FREQ_100_KHZ:
            return 5U;
        case UI_CONTROL_FREQ_1_MHZ:
            return 6U;
        case UI_CONTROL_FREQ_10_MHZ:
            return 7U;
        default:
            return 5U;
    }
}

static uint64_t ui_apply_frequency_delta(uint64_t freq_hz, int16_t delta, uint64_t step_hz)
{
    int64_t next_freq_hz = (int64_t)freq_hz + ((int64_t)delta * (int64_t)step_hz);

    if(next_freq_hz < (int64_t)SI5351_MIN_OUTPUT_HZ)
    {
        next_freq_hz = (int64_t)SI5351_MIN_OUTPUT_HZ;
    }

    return (uint64_t)next_freq_hz;
}

static uint8_t ui_apply_delta_u8(uint8_t value, int16_t delta, uint8_t min, uint8_t max)
{
    int16_t next = (int16_t)value + delta;

    if(next < (int16_t)min)
    {
        return min;
    }
    if(next > (int16_t)max)
    {
        return max;
    }

    return (uint8_t)next;
}

static int8_t ui_apply_delta_i8(int8_t value, int16_t delta, int8_t min, int8_t max)
{
    int16_t next = (int16_t)value + delta;

    if(next < (int16_t)min)
    {
        return min;
    }
    if(next > (int16_t)max)
    {
        return max;
    }

    return (int8_t)next;
}

