rhgndf/hfsdr/ch32v305/src/ui/ui.c
static uint32_t ui_volume_gain_q16(uint8_t volume)
{
    uint64_t volume_squared = (uint64_t)volume * (uint64_t)volume;
    uint64_t max_squared = (uint64_t)UI_VOLUME_MAX * (uint64_t)UI_VOLUME_MAX;

    return (uint32_t)(((uint64_t)UI_AUDIO_GAIN_MAX_Q16 * volume_squared) / max_squared);
}

static void ui_splash_exit_to_waterfall(void)
{
    s_display_mode = UI_DISPLAY_WATERFALL;
    s_active_control = UI_CONTROL_FREQ_10_MHZ;
    s_splash_band_dirty = false;
    s_splash_button_phase = 0U;
    s_displayed_splash_freq_hz = UINT64_MAX;
    s_displayed_splash_appearance = UI_SPLASH_APPEARANCE_COUNT;
    s_redraw_all = true;
    s_displayed_active_control = UI_CONTROL_COUNT;
    s_last_splash_wave_tick = 0ULL;
    s_splash_wave_display_peak = (int32_t)UI_SPLASH_WAVE_MIN_PEAK_ABS;
    s_splash_wave_poly_valid = false;
}

static void ui_handle_button_press(void)
{
    if(s_display_mode == UI_DISPLAY_SPLASH)
    {
        s_splash_button_phase = (uint8_t)((s_splash_button_phase + 1U) % 3U);

        if(s_splash_button_phase == 0U)
        {
            ui_splash_exit_to_waterfall();
            return;
        }

        s_splash_appearance = (s_splash_button_phase == 1U) ? UI_SPLASH_APPEARANCE_INVERTED
                                                            : UI_SPLASH_APPEARANCE_NORMAL;
        s_splash_band_dirty = true;
        s_displayed_splash_freq_hz = UINT64_MAX;
        s_displayed_splash_appearance = UI_SPLASH_APPEARANCE_COUNT;
        return;
    }

    if(s_active_control == UI_CONTROL_TLV320_GAIN)
    {
        s_display_mode = UI_DISPLAY_SPLASH;
        s_splash_band_dirty = true;
        s_splash_button_phase = 0U;
        s_displayed_splash_freq_hz = UINT64_MAX;
        s_displayed_splash_appearance = UI_SPLASH_APPEARANCE_COUNT;
        return;
    }

    s_active_control = (ui_control_t)((uint32_t)s_active_control + 1U);
}

static void ui_draw_selected_frequency_digit(uint64_t freq_hz)
{
    uint8_t digit_power = ui_frequency_digit_power(s_active_control);
    uint16_t digit_index = (uint16_t)(UI_FREQ_DIGITS - 1U - digit_power);

    (void)freq_hz;

    uint16_t center_x = (uint16_t)((digit_index * Font_16x26.width) + (Font_16x26.width / 2U));
    ST7789_DrawFilledTriangle((uint16_t)(center_x - 5U), UI_TRIANGLE_Y,
                              (uint16_t)(center_x + 5U), UI_TRIANGLE_Y,
                              center_x, (uint16_t)(UI_TRIANGLE_Y + 7U),
                              YELLOW);
}

static void ui_draw_frequency(uint64_t freq_hz)
{
    char freq_text[24];

    snprintf(freq_text, sizeof(freq_text), "%9lu", (unsigned long)freq_hz);

    ST7789_Fill(0U, 0U, (uint16_t)(UI_FREQ_TEXT_WIDTH - 1U), (uint16_t)(UI_FREQ_TEXT_Y - 1U), BLACK);
    ST7789_WriteString(0U, UI_FREQ_TEXT_Y, freq_text, Font_16x26, WHITE, BLACK);
    ST7789_WriteString(UI_FREQ_SUFFIX_X, UI_FREQ_TEXT_Y, "Hz", Font_16x26, WHITE, BLACK);
    if(ui_control_is_frequency(s_active_control))
    {
        ui_draw_selected_frequency_digit(freq_hz);
    }
}

static char const *ui_fm_mode_text(void)
{
    return (fm_audio_out_get_mode() == FM_AUDIO_OUT_MODE_NBFM) ? "NBFM" : "WBFM";
}

static void ui_draw_mode_control(void)
{
    bool active = (s_active_control == UI_CONTROL_FM_MODE);
    uint16_t fg = active ? BLACK : CYAN;
    uint16_t bg = active ? CYAN : BLACK;

    ST7789_Fill(UI_MODE_TEXT_X,
                UI_MODE_TEXT_Y,
                (uint16_t)(UI_MODE_TEXT_X + UI_MODE_TEXT_WIDTH - 1U),
                (uint16_t)(UI_MODE_TEXT_Y + UI_MODE_TEXT_HEIGHT - 1U),
                bg);
    ST7789_WriteString(UI_MODE_TEXT_X, UI_MODE_TEXT_Y, ui_fm_mode_text(), Font_11x18, fg, bg);
}

static void ui_draw_progress_row(uint16_t y, char const *label, int16_t value, int16_t min, int16_t max, bool active)
{
    uint16_t color = active ? YELLOW : WHITE;
    uint16_t fill_color = active ? YELLOW : GREEN;
    uint16_t bar_y = (uint16_t)(y + 3U);
    uint16_t inner_width = UI_BAR_WIDTH - 2U;
    uint16_t filled_width = 0U;

    if(max > min)
    {
        int16_t clamped = value;

        if(clamped < min)
        {
            clamped = min;
        }
        if(clamped > max)
        {
            clamped = max;
        }

        filled_width = (uint16_t)(((uint32_t)inner_width * (uint32_t)(clamped - min)) / (uint32_t)(max - min));
    }

    ST7789_WriteString(0U, y, label, Font_11x18, color, BLACK);
    ST7789_DrawRectangle(UI_BAR_X,
                         bar_y,
                         (uint16_t)(UI_BAR_X + UI_BAR_WIDTH - 1U),
                         (uint16_t)(bar_y + UI_BAR_HEIGHT - 1U),
                         color);
    ST7789_Fill((uint16_t)(UI_BAR_X + 1U),
                (uint16_t)(bar_y + 1U),
                (uint16_t)(UI_BAR_X + UI_BAR_WIDTH - 2U),
                (uint16_t)(bar_y + UI_BAR_HEIGHT - 2U),
                BLACK);
    if(filled_width != 0U)
    {
        ST7789_Fill((uint16_t)(UI_BAR_X + 1U),
                    (uint16_t)(bar_y + 1U),
                    (uint16_t)(UI_BAR_X + filled_width),
                    (uint16_t)(bar_y + UI_BAR_HEIGHT - 2U),
                    fill_color);
    }
}

static void ui_draw_header(uint64_t freq_hz)
{
    if(s_redraw_all)
    {
        ST7789_Fill(0U, 0U, ST7789_WIDTH - 1U, UI_HEADER_BOTTOM_Y, BLACK);
    }

    ui_draw_mode_control();
    ui_draw_frequency(freq_hz);
    ui_draw_progress_row(UI_VOL_ROW_Y,
                         "VOL",
                         s_volume,
                         0,
                         UI_VOLUME_MAX,
                         s_active_control == UI_CONTROL_VOLUME);
    ui_draw_progress_row(UI_GAIN_ROW_Y,
                         "GAIN",
                         s_tlv320_gain_db_x2,
                         UI_TLV320_GAIN_MIN_DB_X2,
                         UI_TLV320_GAIN_MAX_DB_X2,
                         s_active_control == UI_CONTROL_TLV320_GAIN);

    s_displayed_freq_hz = freq_hz;
    s_displayed_volume = s_volume;
    s_displayed_tlv320_gain_db_x2 = s_tlv320_gain_db_x2;
    s_displayed_fm_mode = fm_audio_out_get_mode();
    s_displayed_active_control = s_active_control;
    s_redraw_all = false;
}

static void ui_sync_display_hw_for_mode(void)
{
    uint8_t const want_madctl = (s_display_mode == UI_DISPLAY_SPLASH) ? 3U : (uint8_t)ST7789_ROTATION;

