rhgndf/hfsdr/ch32v305/src/ui/ui.c
    if(s_hw_madctl == want_madctl)
    {
        return;
    }

    uint8_t const prev_madctl = s_hw_madctl;

    s_hw_madctl = want_madctl;
    ST7789_SetRotation(want_madctl);

    if(want_madctl == 3U)
    {
        /* Landscape: full-screen PCB splash; turn off FFT scroll window first. */
        ST7789_VerticalScrollDisable();
        s_splash_band_dirty = true;
        return;
    }

    /* Portrait: radio header + waterfall. */
    UI_FFT_Init();
    if(prev_madctl == 3U)
    {
        ST7789_Fill(0U,
                    UI_WATERFALL_TOP,
                    ST7789_WIDTH - 1U,
                    (uint16_t)(UI_WATERFALL_BOTTOM - 1U),
                    BLACK);
    }
    s_redraw_all = true;
}

static void ui_splash_colors(uint16_t *fg, uint16_t *bg)
{
    if(s_splash_appearance == UI_SPLASH_APPEARANCE_INVERTED)
    {
        *fg = BLACK;
        *bg = WHITE;
    }
    else
    {
        *fg = WHITE;
        *bg = BLACK;
    }
}

static int32_t ui_splash_edge_x_at_y(int32_t x0, int32_t y0, int32_t x1, int32_t y1, int32_t y, bool *valid)
{
    *valid = false;

    if(y0 == y1)
    {
        if(y == y0)
        {
            *valid = true;
            return x0;
        }

        return 0;
    }

    int32_t y_min = (y0 < y1) ? y0 : y1;
    int32_t y_max = (y0 > y1) ? y0 : y1;

    if((y < y_min) || (y > y_max))
    {
        return 0;
    }

    *valid = true;
    return x0 + ((y - y0) * (x1 - x0)) / (y1 - y0);
}

static void ui_splash_quad_scanline_bounds(const ui_splash_quad_t *quad, int32_t y, int32_t *x_lo, int32_t *x_hi)
{
    int32_t xs[4];
    int32_t n = 0;

    bool valid;
    int32_t x = ui_splash_edge_x_at_y((int32_t)quad->x0,
                                      (int32_t)quad->y0,
                                      (int32_t)quad->x1,
                                      (int32_t)quad->y1,
                                      y,
                                      &valid);
    if(valid)
    {
        xs[n++] = x;
    }

    x = ui_splash_edge_x_at_y((int32_t)quad->x1,
                              (int32_t)quad->y1,
                              (int32_t)quad->x2,
                              (int32_t)quad->y2,
                              y,
                              &valid);
    if(valid)
    {
        xs[n++] = x;
    }

    x = ui_splash_edge_x_at_y((int32_t)quad->x2,
                              (int32_t)quad->y2,
                              (int32_t)quad->x3,
                              (int32_t)quad->y3,
                              y,
                              &valid);
    if(valid)
    {
        xs[n++] = x;
    }

    x = ui_splash_edge_x_at_y((int32_t)quad->x3,
                              (int32_t)quad->y3,
                              (int32_t)quad->x0,
                              (int32_t)quad->y0,
                              y,
                              &valid);
    if(valid)
    {
        xs[n++] = x;
    }

    if(n < 2)
    {
        *x_lo = 0;
        *x_hi = -1;
        return;
    }

    for(int32_t i = 0; i < (n - 1); ++i)
    {
        for(int32_t j = (i + 1); j < n; ++j)
        {
            if(xs[j] < xs[i])
            {
                int32_t tmp = xs[i];
                xs[i] = xs[j];
                xs[j] = tmp;
            }
        }
    }

    *x_lo = xs[0];
    *x_hi = xs[n - 1];
}

static uint16_t ui_splash_quad_y_min(const ui_splash_quad_t *quad)
{
    uint16_t m = quad->y0;

    if(quad->y1 < m)
    {
        m = quad->y1;
    }
    if(quad->y2 < m)
    {
        m = quad->y2;
    }
    if(quad->y3 < m)
    {
        m = quad->y3;
    }

    return m;
}

static uint16_t ui_splash_quad_y_max(const ui_splash_quad_t *quad)
{
    uint16_t m = quad->y0;

    if(quad->y1 > m)
    {
        m = quad->y1;
    }
    if(quad->y2 > m)
    {
        m = quad->y2;
    }
    if(quad->y3 > m)
    {
        m = quad->y3;
    }

    return m;
}

static void ui_splash_fill_quad(const ui_splash_quad_t *quad, uint16_t color)
{
    uint16_t y_min = ui_splash_quad_y_min(quad);
    uint16_t y_max = ui_splash_quad_y_max(quad);

    for(int32_t y = (int32_t)y_min; y <= (int32_t)y_max; ++y)
    {
        int32_t x_lo;
        int32_t x_hi;

        ui_splash_quad_scanline_bounds(quad, y, &x_lo, &x_hi);

        if(x_hi < x_lo)
        {
            continue;
        }

        if(x_lo < 0)
        {
            x_lo = 0;
        }

        ST7789_Fill((uint16_t)x_lo, (uint16_t)y, (uint16_t)x_hi, (uint16_t)y, color);
    }
}

static void ui_splash_restore_quad_bitmap(const ui_splash_quad_t *quad, uint16_t fg, uint16_t bg)
{
    uint16_t y_min = ui_splash_quad_y_min(quad);
    uint16_t y_max = ui_splash_quad_y_max(quad);

    for(int32_t y = (int32_t)y_min; y <= (int32_t)y_max; ++y)
    {
        int32_t x_lo;
        int32_t x_hi;

        ui_splash_quad_scanline_bounds(quad, y, &x_lo, &x_hi);

        if(x_hi < x_lo)
        {
            continue;
        }

        if(x_lo < 0)
        {
            x_lo = 0;
        }

        ST7789_BlitBitmap1bppRow((uint16_t)x_lo,
                                 (uint16_t)y,
                                 (uint16_t)(x_hi - x_lo + 1),
                                 splash_freq_screen_w,
                                 splash_freq_screen,
                                 fg,
                                 bg);
    }
}

static const ui_splash_quad_t s_splash_quad_mhz = {
    UI_SPLASH_TEXT_X0, UI_SPLASH_TEXT_Y0,
    UI_SPLASH_TEXT_X1, UI_SPLASH_TEXT_Y1,
    UI_SPLASH_TEXT_X2, UI_SPLASH_TEXT_Y2,
    UI_SPLASH_TEXT_X3, UI_SPLASH_TEXT_Y3
};

static const ui_splash_quad_t s_splash_quad_wave = {
    UI_SPLASH_WAVE_X0, UI_SPLASH_WAVE_Y0,
    UI_SPLASH_WAVE_X1, UI_SPLASH_WAVE_Y1,
    UI_SPLASH_WAVE_X2, UI_SPLASH_WAVE_Y2,
    UI_SPLASH_WAVE_X3, UI_SPLASH_WAVE_Y3
};

static uint64_t ui_splash_ticks_from_ms(uint32_t ms)
{
    uint64_t ticks = ((uint64_t)SystemCoreClock * (uint64_t)ms) / 1000ULL;

    return (ticks == 0ULL) ? 1ULL : ticks;
}

static uint16_t ui_splash_clamp_u16(int32_t v, uint16_t max_u)
{
    if(v < 0)
    {
        return 0U;
    }
    if(v > (int32_t)max_u)
    {
        return max_u;
    }

