rhgndf/hfsdr/ch32v305/src/ui/ui.c
    return (uint16_t)v;
}


static int32_t ui_waveform_get(size_t idx)
{
    const volatile uint32_t* buf = dac_hw_stream_ring_samples();
    const volatile uint16_t* buf_idx = (const volatile uint16_t*)&buf[idx];
    return *buf_idx;
}

static void ui_draw_splash_waveform(void)
{
    uint16_t px_col[UI_SPLASH_WAVE_DISPLAY_COLS];
    uint16_t py_col[UI_SPLASH_WAVE_DISPLAY_COLS];
    size_t const display_cols = (size_t)UI_SPLASH_WAVE_DISPLAY_COLS;
    uint16_t trace_color;
    uint16_t scope_fill;

    ui_splash_colors(&scope_fill, &trace_color);

    size_t n = 2048;
    if((n < 2U) || (display_cols < 2U))
    {
        s_splash_wave_poly_valid = false;
        return;
    }

    int32_t frame_peak = (int32_t)UI_SPLASH_WAVE_MIN_PEAK_ABS;
    for(size_t i = 0U; i < n; ++i)
    {
        int32_t raw = (int32_t)ui_waveform_get(i) - 2048;
        if(raw < 0)
        {
            raw = -raw;
        }
        if(raw > frame_peak)
        {
            frame_peak = raw;
        }
    }

    if(frame_peak > s_splash_wave_display_peak)
    {
        s_splash_wave_display_peak = frame_peak;
    }
    else
    {
        int32_t decay = s_splash_wave_display_peak / 24;
        if(decay < 6)
        {
            decay = 6;
        }
        s_splash_wave_display_peak -= decay;
        if(s_splash_wave_display_peak < (int32_t)UI_SPLASH_WAVE_MIN_PEAK_ABS)
        {
            s_splash_wave_display_peak = (int32_t)UI_SPLASH_WAVE_MIN_PEAK_ABS;
        }
    }

    if(s_splash_wave_display_peak > (int32_t)UI_SPLASH_WAVE_PEAK_CEILING)
    {
        s_splash_wave_display_peak = (int32_t)UI_SPLASH_WAVE_PEAK_CEILING;
    }

    uint16_t w_lim = (uint16_t)(ST7789_GetWidth() - 1U);
    uint16_t h_lim = (uint16_t)(ST7789_GetHeight() - 1U);

    int32_t den_plot = (int32_t)(display_cols - 1U);
    int32_t const dx_top = (int32_t)UI_SPLASH_WAVE_X3 - (int32_t)UI_SPLASH_WAVE_X0;
    int32_t const dy_top = (int32_t)UI_SPLASH_WAVE_Y3 - (int32_t)UI_SPLASH_WAVE_Y0;
    int32_t const dx_bot = (int32_t)UI_SPLASH_WAVE_X2 - (int32_t)UI_SPLASH_WAVE_X1;
    int32_t const dy_bot = (int32_t)UI_SPLASH_WAVE_Y2 - (int32_t)UI_SPLASH_WAVE_Y1;

    for(size_t i = 0U; i < display_cols; ++i)
    {
        int32_t j = ((int32_t)i * (int32_t)(n - 1U)) / den_plot;
        uint32_t jm = (uint32_t)j > 0U ? (uint32_t)j - 1U : 0U;
        uint32_t jp = (uint32_t)j + 1U < n ? (uint32_t)j + 1U : (uint32_t)(n - 1U);
        int32_t sum3 = (int32_t)ui_waveform_get(jm) + (int32_t)ui_waveform_get(j) + (int32_t)ui_waveform_get(jp);
        int32_t raw = (sum3 / 3) - 2048;
        int32_t amp = (raw * (int32_t)UI_SPLASH_WAVE_DEFLECT_MUL) / s_splash_wave_display_peak;

        int32_t x_top = (int32_t)UI_SPLASH_WAVE_X0 + (((int32_t)i * dx_top) / den_plot);
        int32_t y_top = (int32_t)UI_SPLASH_WAVE_Y0 + (((int32_t)i * dy_top) / den_plot);
        int32_t x_bot = (int32_t)UI_SPLASH_WAVE_X1 + (((int32_t)i * dx_bot) / den_plot);
        int32_t y_bot = (int32_t)UI_SPLASH_WAVE_Y1 + (((int32_t)i * dy_bot) / den_plot);
        int32_t x_center = (x_top + x_bot) / 2;
        int32_t y_center = (y_top + y_bot) / 2;
        int32_t vx = x_bot - x_top;
        int32_t vy = y_bot - y_top;

        int32_t px = x_center + ((vx * amp) / (int32_t)UI_SPLASH_WAVE_DEFLECT_DIV);
        int32_t py = y_center + ((vy * amp) / (int32_t)UI_SPLASH_WAVE_DEFLECT_DIV);

        px_col[i] = ui_splash_clamp_u16(px, w_lim);
        py_col[i] = ui_splash_clamp_u16(py, h_lim);
    }

    if(s_splash_wave_poly_valid)
    {
        for(size_t i = 1U; i < display_cols; ++i)
        {
            ST7789_DrawLineFills(s_splash_wave_prev_x[i - 1U],
                                 s_splash_wave_prev_y[i - 1U],
                                 s_splash_wave_prev_x[i],
                                 s_splash_wave_prev_y[i],
                                 scope_fill);
        }
    }
    else
    {
        ui_splash_fill_quad(&s_splash_quad_wave, scope_fill);
    }

    for(size_t i = 1U; i < display_cols; ++i)
    {
        ST7789_DrawLineFills(px_col[i - 1U], py_col[i - 1U], px_col[i], py_col[i], trace_color);
    }

    for(size_t i = 0U; i < display_cols; ++i)
    {
        s_splash_wave_prev_x[i] = px_col[i];
        s_splash_wave_prev_y[i] = py_col[i];
    }

    s_splash_wave_poly_valid = true;
}

static void ui_draw_splash_freq_overlay(uint64_t freq_hz)
{
    char text[20];
    unsigned long mhz = (unsigned long)(freq_hz / 1000000ULL);
    unsigned long mhz_frac = (unsigned long)((freq_hz % 1000000ULL) / 100000ULL);

    snprintf(text, sizeof(text), "%lu.%lu MHz", mhz, mhz_frac);

    uint16_t text_fg = (s_splash_appearance == UI_SPLASH_APPEARANCE_INVERTED) ? BLACK : WHITE;
    uint16_t text_bg = (s_splash_appearance == UI_SPLASH_APPEARANCE_INVERTED) ? WHITE : BLACK;

    ui_splash_fill_quad(&s_splash_quad_mhz, text_bg);

    size_t text_len = strlen(text);
    int32_t top_span_x = (int32_t)UI_SPLASH_TEXT_X1 - (int32_t)UI_SPLASH_TEXT_X0;
    int32_t text_span_x = (int32_t)text_len * UI_SPLASH_TEXT_BASELINE_DX;
    int32_t start_x = (int32_t)UI_SPLASH_TEXT_X0 + ((top_span_x - text_span_x) / 2);
    int32_t start_y = (int32_t)UI_SPLASH_TEXT_Y0 + 12;

    if(top_span_x > 0)
    {
        start_y += (((top_span_x - text_span_x) / 2) * ((int32_t)UI_SPLASH_TEXT_Y1 - (int32_t)UI_SPLASH_TEXT_Y0)) /
                   top_span_x;
    }

    ST7789_WriteStringSlanted(start_x,
                              start_y,
                              text,
                              Font_11x18,
                              text_fg,
                              UI_SPLASH_TEXT_BASELINE_DX,
                              UI_SPLASH_TEXT_BASELINE_DY,
                              UI_SPLASH_TEXT_SHEAR_NUM,
                              UI_SPLASH_TEXT_SHEAR_DEN);
}

static void ui_draw_splash_fullscreen_landscape(uint64_t freq_hz)
{
    s_splash_wave_poly_valid = false;

    uint16_t bitmap_fg;
    uint16_t bitmap_bg;

    ui_splash_colors(&bitmap_fg, &bitmap_bg);

    ST7789_Fill_Color(bitmap_bg);
    ST7789_DrawBitmap1bpp(0U,
                          0U,
                          splash_freq_screen_w,
                          splash_freq_screen_h,
                          splash_freq_screen,
                          bitmap_fg,
                          bitmap_bg);
    ui_draw_splash_freq_overlay(freq_hz);
    ui_draw_splash_waveform();
}

static void ui_apply_encoder_delta(int16_t delta, uint64_t freq_hz, uint64_t *next_freq_hz)
{
    *next_freq_hz = freq_hz;

