rhgndf/hfsdr/ch32v305/src/ui/ui.c
    if(delta == 0)
    {
        return;
    }

    switch(s_active_control)
    {
        case UI_CONTROL_FREQ_10_KHZ:
        case UI_CONTROL_FREQ_100_KHZ:
        case UI_CONTROL_FREQ_1_MHZ:
        case UI_CONTROL_FREQ_10_MHZ:
        {
            uint64_t requested_freq_hz = ui_apply_frequency_delta(freq_hz, delta, ui_frequency_step_hz(s_active_control));

            if(usb_hw_set_clk_freq_hz(requested_freq_hz) == READY)
            {
                *next_freq_hz = si5351_hw_clk0_get_freq_hz();
            }
            break;
        }

        case UI_CONTROL_VOLUME:
        {
            uint8_t volume = ui_apply_delta_u8(s_volume, delta, 0U, UI_VOLUME_MAX);

            if(volume != s_volume)
            {
                s_volume = volume;
                fm_audio_out_set_gain(ui_volume_gain_q16(s_volume));
            }
            break;
        }

        case UI_CONTROL_FM_MODE:
        {
            fm_audio_out_mode_t mode = fm_audio_out_get_mode();

            if(delta > 0)
            {
                mode = (mode == FM_AUDIO_OUT_MODE_WBFM) ? FM_AUDIO_OUT_MODE_NBFM : FM_AUDIO_OUT_MODE_WBFM;
            }
            else
            {
                mode = (mode == FM_AUDIO_OUT_MODE_NBFM) ? FM_AUDIO_OUT_MODE_WBFM : FM_AUDIO_OUT_MODE_NBFM;
            }

            fm_audio_out_set_mode(mode);
            break;
        }

        case UI_CONTROL_TLV320_GAIN:
        {
            int8_t gain_db_x2 = ui_apply_delta_i8(s_tlv320_gain_db_x2, delta, UI_TLV320_GAIN_MIN_DB_X2, UI_TLV320_GAIN_MAX_DB_X2);

            if((gain_db_x2 != s_tlv320_gain_db_x2) && (usb_hw_set_tlv320_gain_db_x2(gain_db_x2) == READY))
            {
                s_tlv320_gain_db_x2 = gain_db_x2;
            }
            break;
        }

        case UI_CONTROL_COUNT:
        default:
            break;
    }
}

void UI_Init(void)
{
    s_displayed_freq_hz = UINT64_MAX;
    s_displayed_volume = UINT8_MAX;
    s_displayed_tlv320_gain_db_x2 = INT8_MAX;
    s_displayed_fm_mode = FM_AUDIO_OUT_MODE_COUNT;
    s_displayed_active_control = UI_CONTROL_COUNT;
    s_active_control = UI_CONTROL_FREQ_10_MHZ;
    s_volume = UI_VOLUME_DEFAULT;
    s_tlv320_gain_db_x2 = UI_TLV320_GAIN_DEFAULT_DB_X2;
    s_redraw_all = true;
    s_display_mode = UI_DISPLAY_SPLASH;
    s_splash_band_dirty = true;
    s_splash_button_phase = 0U;
    s_displayed_splash_freq_hz = UINT64_MAX;
    s_displayed_splash_appearance = UI_SPLASH_APPEARANCE_COUNT;
    s_last_splash_wave_tick = 0ULL;
    fm_audio_out_set_mode(FM_AUDIO_OUT_MODE_WBFM);
    fm_audio_out_set_gain(ui_volume_gain_q16(s_volume));
    UI_Draw();
}

bool UI_ShouldDrawFft(void)
{
    return (bool)(s_display_mode == UI_DISPLAY_WATERFALL);
}

void UI_Draw(void)
{
    int16_t encoder_delta = encoder_take_delta();
    uint64_t freq_hz = si5351_hw_clk0_get_freq_hz();

    if(encoder_take_button_press())
    {
        ui_handle_button_press();
    }

    ui_sync_display_hw_for_mode();

    if(s_display_mode == UI_DISPLAY_WATERFALL)
    {
        ui_apply_encoder_delta(encoder_delta, freq_hz, &freq_hz);
    }
    else if(encoder_delta != 0)
    {
        uint64_t requested_freq_hz = ui_apply_frequency_delta(freq_hz, encoder_delta, UI_SPLASH_FREQ_STEP_HZ);

        if(usb_hw_set_clk_freq_hz(requested_freq_hz) == READY)
        {
            freq_hz = si5351_hw_clk0_get_freq_hz();
        }
    }

    if((s_display_mode == UI_DISPLAY_WATERFALL) &&
       (s_redraw_all ||
        (freq_hz != s_displayed_freq_hz) ||
        (s_volume != s_displayed_volume) ||
        (s_tlv320_gain_db_x2 != s_displayed_tlv320_gain_db_x2) ||
        (fm_audio_out_get_mode() != s_displayed_fm_mode) ||
        (s_active_control != s_displayed_active_control)))
    {
        ui_draw_header(freq_hz);
    }

    if(s_display_mode == UI_DISPLAY_SPLASH)
    {
        bool const full_splash = (s_splash_band_dirty || (s_splash_appearance != s_displayed_splash_appearance));
        uint64_t const now_tick = SysTick->CNT;
        uint64_t const wave_period = ui_splash_ticks_from_ms(UI_SPLASH_WAVE_PERIOD_MS);
        bool wave_due = (s_last_splash_wave_tick == 0ULL) ||
                        ((now_tick - s_last_splash_wave_tick) >= wave_period);

        if(full_splash)
        {
            ui_draw_splash_fullscreen_landscape(freq_hz);
            s_splash_band_dirty = false;
            s_displayed_splash_freq_hz = freq_hz;
            s_displayed_splash_appearance = s_splash_appearance;
            s_last_splash_wave_tick = now_tick;
        }
        else
        {
            if(freq_hz != s_displayed_splash_freq_hz)
            {
                ui_draw_splash_freq_overlay(freq_hz);
                s_displayed_splash_freq_hz = freq_hz;
            }

            if(wave_due)
            {
                ui_draw_splash_waveform();
                s_last_splash_wave_tick = now_tick;
            }
        }
    }
}
